/*
 * Phoenix-RTOS
 *
 * GRLIB NANDFCTRL2 NAND flash driver.
 *
 * Low-level userspace driver using DMA Linked List Mode.
 * Supports only asynchronouse interface.
 *
 * Copyright 2026 Phoenix Systems
 * Author: Lukasz Leczkowski
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <assert.h>
#include <errno.h>
#include <inttypes.h>
#include <limits.h>
#include <stdbool.h>
#include <stdatomic.h>
#include <stdio.h>
#include <string.h>

#include <sys/interrupt.h>
#include <sys/mman.h>
#include <sys/platform.h>
#include <sys/threads.h>

#include <board_config.h>
#include <phoenix/gaisler/ambapp.h>

#ifdef __CPU_GR765
#include <phoenix/arch/riscv64/riscv64.h>
#else
#error "Unsupported TARGET"
#endif

#include "nandfctrl2-flashdrv.h"
#include "onfi-4.h"


/* clang-format off */
#define LOG(fmt, ...)       do { printf("grlib-nandfctrl2: " fmt "\n", ##__VA_ARGS__); } while (0)
#define TRACE(fmt, ...)     do { if (0) { LOG("%s:%d:" fmt, __FILE__, __LINE__, ##__VA_ARGS__); } } while (0)
#define LOG_ERROR(fmt, ...) do { LOG("error: " fmt, ##__VA_ARGS__); } while (0)
/* clang-format on */


#define NAND_BBM_SIZE         2 /* Bad Block Marker size in bytes */
#define ECC_BITFLIP_THRESHOLD 5 /* Min number of bitflips for page rewrite */


/* ============================== Register layout ============================== */


typedef struct {
	uint32_t ctrl0;    /* 0x000: Core control 0 */
	uint32_t ctrl1;    /* 0x004: Core control 1 (interrupt masks) */
	uint32_t ctrl2;    /* 0x008: Core control 2 (abort/reset/trigger) */
	uint32_t ctrl3;    /* 0x00c: Core control 3 */
	uint32_t ctrl4;    /* 0x010: Core control 4 */
	uint32_t res0[3];  /* 0x014-0x01f */
	uint32_t sts0;     /* 0x020: Core status 0 */
	uint32_t sts1;     /* 0x024: Core status 1 */
	uint32_t sts2;     /* 0x028: Core status 2 */
	uint32_t sts3;     /* 0x02c: Core status 3 */
	uint32_t res1[2];  /* 0x030-0x037 */
	uint32_t cap0;     /* 0x038: Capability 0 */
	uint32_t cap1;     /* 0x03c: Capability 1 */
	uint32_t cap2;     /* 0x040: Capability 2 */
	uint32_t cap3;     /* 0x044: Capability 3 */
	uint32_t cap4;     /* 0x048: Capability 4 */
	uint32_t cap5;     /* 0x04c: Capability 5 */
	uint32_t tme0;     /* 0x050: Timing 0 */
	uint32_t tme1;     /* 0x054: Timing 1 */
	uint32_t tme2;     /* 0x058: Timing 2 */
	uint32_t tme3;     /* 0x05c: Timing 3 */
	uint32_t tme4;     /* 0x060: Timing 4 */
	uint32_t tme5;     /* 0x064: Timing 5 */
	uint32_t tme6;     /* 0x068: Timing 6 */
	uint32_t tme7;     /* 0x06c: Timing 7 */
	uint32_t tme8;     /* 0x070: Timing 8 */
	uint32_t tme9;     /* 0x074: Timing 9 */
	uint32_t tme10;    /* 0x078: Timing 10 */
	uint32_t tme11;    /* 0x07c: Timing 11 */
	uint32_t res2[16]; /* 0x080-0x0bf */
	uint32_t txskew0;  /* 0x0c0: TX skew control */
	uint32_t rxskew0;  /* 0x0c4: RX skew control */
	uint32_t res3[2];  /* 0x0c8-0x0cf */
	uint32_t tout0;    /* 0x0d0: Timeout 0 */
	uint32_t res4[31]; /* 0x0d4-0x14f */
	uint32_t llpl;     /* 0x150: Linked list pointer low */
	uint32_t res5;     /* 0x154 */
	uint32_t res6[2];  /* 0x158-0x15f */
	uint32_t dcmd;     /* 0x160: Descriptor command (register mode) */
	uint32_t dtarsel0; /* 0x164: Descriptor target select 0 */
	uint32_t dtarsel1; /* 0x168: Descriptor target select 1 */
	uint32_t dchsel;   /* 0x16c: Descriptor channel select */
	uint32_t drbsel;   /* 0x170: Descriptor ready/busy select */
	uint32_t drow;     /* 0x174: Descriptor row address + control */
	uint32_t dcolsize; /* 0x178: Descriptor column address + size */
	uint32_t dsts;     /* 0x17c: Descriptor status */
	uint32_t deccsts0; /* 0x180: Descriptor ECC status */
	uint32_t res7[3];  /* 0x184-0x18f */
	uint32_t ddpl;     /* 0x190: Descriptor data pointer low */
	uint32_t res8[19]; /* 0x194-0x1df */
	uint32_t din0;     /* 0x1e0: Data-in 0 */
	uint32_t din1;     /* 0x1e4: Data-in 1 */
	uint32_t din2;     /* 0x1e8: Data-in 2 */
	uint32_t din3;     /* 0x1ec: Data-in 3 */
	uint32_t dout0;    /* 0x1f0: Data-out 0 */
	uint32_t dout1;    /* 0x1f4: Data-out 1 */
	uint32_t dout2;    /* 0x1f8: Data-out 2 */
	uint32_t dout3;    /* 0x1fc: Data-out 3 */
} nandfctrl2_regs_t;


/* ============================== Register bit definitions ============================== */

/* Core control 0 register */
#define CTRL0_EE        (1U << 13) /* EDAC enable */
#define CTRL0_LLM       (1U << 10) /* Linked list mode */
#define CTRL0_BBM       (1U << 9)  /* Preserve bad block marking */
#define CTRL0_MSEL_SHFT 3          /* Memory select shift */
#define CTRL0_MSEL_MSK  (3U << 3)  /* Memory select mask */

/* Core control 1 register */
#define CTRL1_IRQ_CERRDL  (1U << 13) /* Correctable error, downlink syncrams */
#define CTRL1_IRQ_CERRUL  (1U << 12) /* Correctable error, uplink syncrams */
#define CTRL1_IRQ_UCERRDL (1U << 11) /* Uncorrectable error, downlink syncrams */
#define CTRL1_IRQ_UCERRUL (1U << 10) /* Uncorrectable error, uplink syncrams */
#define CTRL1_IRQ_STOPLL  (1U << 9)  /* Stop linked list */
#define CTRL1_IRQ_ABORT   (1U << 8)  /* Abort done */
#define CTRL1_IRQ_TMOUT   (1U << 6)  /* Timeout */
#define CTRL1_IRQ_CMD     (1U << 5)  /* Invalid command */
#define CTRL1_IRQ_DL      (1U << 4)  /* DMA read (uplink write) error */
#define CTRL1_IRQ_UL      (1U << 3)  /* DMA write (downlink read) error */
#define CTRL1_IRQ_ECC     (1U << 2)  /* ECC uncorrectable */
#define CTRL1_IRQ_DS      (1U << 1)  /* Descriptor done */
#define CTRL1_IRQ         (1U << 0)  /* Main interrupt enable */

/* Interrupt enable mask - enables main IRQ + DS + all error sources */
#define CTRL1_OPS_IRQ_MASK \
	(CTRL1_IRQ | CTRL1_IRQ_DS | CTRL1_IRQ_ECC | CTRL1_IRQ_UL | CTRL1_IRQ_DL | CTRL1_IRQ_CMD | CTRL1_IRQ_TMOUT | CTRL1_IRQ_ABORT | CTRL1_IRQ_STOPLL)

/* Core control 2 register */
#define CTRL2_STOP_LL (1U << 3) /* Stop linked list */
#define CTRL2_ABORT   (1U << 2) /* Abort execution */
#define CTRL2_DT      (1U << 1) /* Descriptor trigger */
#define CTRL2_RST     (1U << 0) /* Software reset */

/* Core status 0 register */
#define STS0_DA  (1U << 3) /* Descriptor active */
#define STS0_RDY (1U << 0) /* Controller ready */

/* Core status 1 register */
#define STS1_UCERRDL (1U << 11) /* Uncorrectable error, downlink syncrams */
#define STS1_UCERRUL (1U << 10) /* Uncorrectable error, uplink syncrams */
#define STS1_ABORT   (1U << 8)  /* Abort complete */
#define STS1_TMOUT   (1U << 6)  /* Timeout */
#define STS1_DL      (1U << 4)  /* DMA read (uplink write) error */
#define STS1_UL      (1U << 3)  /* DMA write (downlink read) error */

#define STS1_FATAL_MSK (STS1_UCERRDL | STS1_UCERRUL | STS1_TMOUT | STS1_DL | STS1_UL)

/* Descriptor command register */
#define DCMD_CMD2_SHFT   24
#define DCMD_CMD1_SHFT   16
#define DCMD_DD          (1U << 11)               /* Data DMA disable (use APB, not DMA) */
#define DCMD_ED          (1U << 10)               /* EDAC disable */
#define DCMD_RD          (1U << 9)                /* Randomization disable */
#define DCMD_SUBCMD_SHFT 7                        /* Sub command shift */
#define DCMD_SUBCMD_MSK  (3U << DCMD_SUBCMD_SHFT) /* Sub command mask */
#define DCMD_SRB         (1U << 6)                /* Skip Ready/Busy wait before command */
#define DCMD_SA          (1U << 5)                /* Skip address phase */
#define DCMD_SD          (1U << 4)                /* Skip data phase */
#define DCMD_SC2         (1U << 3)                /* Skip second command (CMD2) phase */
#define DCMD_WARDY       (1U << 2)                /* Wait for ARDY after last command */
#define DCMD_IRQ_DS      (1U << 1)                /* Generate interrupt when descriptor finishes */
#define DCMD_EN          (1U << 0)                /* Descriptor enable */

/* Descriptor row & control register */
#define DROW_TAGEN (1U << 24) /* Tag enable */

/* Descriptor column & size register */
#define DCOLSIZE_SIZE_SHFT 16 /* Transfer size shift */

/* Descriptor status register */
#define DSTS_ECFAIL_SHFT 16                            /* ECC chunk fail bitmap shift */
#define DSTS_ECFAIL_MSK  (0xffffU << DSTS_ECFAIL_SHFT) /* ECC chunk fail bitmap mask */
#define DSTS_CERR_DL     (1U << 8)                     /* Correctable error, downlink syncrams */
#define DSTS_CERR_UL     (1U << 7)                     /* Correctable error, uplink syncrams */
#define DSTS_UCERR_DL    (1U << 6)                     /* Uncorrectable error, downlink syncrams */
#define DSTS_UCERR_UL    (1U << 5)                     /* Uncorrectable error, uplink syncrams */
#define DSTS_TMOUT       (1U << 4)                     /* Timeout */
#define DSTS_STOP_LL     (1U << 3)                     /* Stop linked list */
#define DSTS_ABORT       (1U << 2)                     /* Abort */
#define DSTS_UE          (1U << 1)                     /* Uncorrectable ECC error */
#define DSTS_INV         (1U << 0)                     /* Invalid command */

/* Descriptor ECC status register */
#define DECCSTS_CEC_SHFT 16                          /* Corrected errors in worst chunk shift */
#define DECCSTS_CEC_MSK  (0xffU << DECCSTS_CEC_SHFT) /* Corrected errors in worst chunk mask */
#define DECCSTS_CE_MSK   0xfffU                      /* Total corrected errors mask */

/* Capability 1 register */
#define CAP1_E1CAP_SHFT   26
#define CAP1_E1CHUNK_SHFT 21
#define CAP1_E1GF_SHFT    16
#define CAP1_E0CAP_SHFT   10
#define CAP1_E0CHUNK_SHFT 5
#define CAP1_E0GF_SHFT    0

#define CAP1_E1CAP   (0x3fU << CAP1_E1CAP_SHFT)
#define CAP1_E1CHUNK (0x1fU << CAP1_E1CHUNK_SHFT)
#define CAP1_E1GF    (0x1fU << CAP1_E1GF_SHFT)
#define CAP1_E0CAP   (0x3fU << CAP1_E0CAP_SHFT)
#define CAP1_E0CHUNK (0x1fU << CAP1_E0CHUNK_SHFT)
#define CAP1_E0GF    (0x1fU << CAP1_E0GF_SHFT)

/* Capability 2/3/4 register */
#define CAP_MSEL_SHFT   31
#define CAP_MSPARE_SHFT 16

#define CAP_MSEL   (1U << CAP_MSEL_SHFT)
#define CAP_MSPARE (0x1fffU << CAP_MSPARE_SHFT)
#define CAP_MDATA  0xffffU


/* ============================== Descriptor layout ============================== */

/*
 * LLM descriptor - must be 0x40 (64) byte aligned.
 * Fields mirror the APB shadow descriptor registers (0x160-0x190).
 * dsts and deccsts are written back by hardware after execution.
 */
typedef struct {
	uint32_t dcmd;     /* 0x00: Command, flags */
	uint32_t dtarsel0; /* 0x04: Target select low 32 bits */
	uint32_t dtarsel1; /* 0x08: Target select high 32 bits */
	uint32_t dchsel;   /* 0x0c: Channel select mask */
	uint32_t drbsel;   /* 0x10: Ready/Busy select mask */
	uint32_t drow;     /* 0x14: Row address + control */
	uint32_t dcolsize; /* 0x18: Size (31:16) | Column address (15:0) */
	uint32_t dsts;     /* 0x1c: Descriptor status (written by HW) */
	uint32_t deccsts;  /* 0x20: ECC status (written by HW) */
	uint32_t res1[3];  /* 0x24-0x2c */
	uint32_t ddpl;     /* 0x30: DMA data pointer (physical address) */
	uint32_t res2;     /* 0x34 */
	uint32_t dllpl;    /* 0x38: Next descriptor physical address (0 = end) */
	uint32_t res3;     /* 0x3c */
} nandfctrl2_desc_t;


/* ============================== DMA chain management ============================== */


#define DMA_SCRATCH_SIZE _PAGE_SIZE
#define DMA_DESC_SIZE    _PAGE_SIZE
#define DMA_MAX_DESCS    (DMA_DESC_SIZE / sizeof(nandfctrl2_desc_t))

#define DMA_NO_ECC            0U
#define DMA_PROGRAM_NO_COMMIT 0U
#define DMA_WITH_ECC          (1U << 0)
#define DMA_PROGRAM_COMMIT    (1U << 1)

typedef struct {
	uint32_t ndesc; /* Number of descriptors currently in the chain */
} flashdrv_dma_hdr_t;


struct _flashdrv_dma_t {
	flashdrv_dma_hdr_t hdr;
	nandfctrl2_desc_t *descs;
	void *scratchBuf;
};


typedef struct {
	uint32_t rowAddr;    /* 24-bit Page/Block address */
	uint16_t colAddr;    /* 16-bit Byte offset within the page */
	size_t transferSize; /* Number of bytes to read/write */
	addr_t data;         /* DMA physical address (0 if no data phase) */
} dma_xfer_t;


typedef struct {
	uint8_t manufacturerId;
	uint8_t deviceId;
